[{"id":"tt0092455","title":"Star Trek: The Next Generation","year":"(1987–1994)","rating":"8.6","genres":"Action, Adventure, Mystery","description":"Set decades after Captain Kirk's five-year mission, a new generation of Starfleet officers set off in a new Enterprise on their own mission to go where no one has gone before.","stars":"Patrick Stewart, Brent Spiner, Jonathan Frakes, LeVar Burton","directors":null},{"id":"tt2461150","title":"Masterminds","year":"(I) (2016)","rating":"5.8","genres":"Action, Comedy, Crime","description":"A guard at an armored car company in the Southern U.S. organizes one of the biggest bank heists in American history. Based on the October 1997 Loomis Fargo robbery.","stars":"Zach Galifianakis, Kristen Wiig, Owen Wilson, Ross Kimball","directors":"Jared Hess"},{"id":"tt1839578","title":"Person of Interest","year":"(2011–2016)","rating":"8.5","genres":"Action, Crime, Drama","description":"An ex-assassin and a wealthy programmer save lives via a surveillance AI that sends them the identities of civilians involved in impending crimes. However, the details of the crimes--including the civilians' roles--are left a mystery.","stars":"Jim Caviezel, Taraji P. Henson, Kevin Chapman, Michael Emerson","directors":null},{"id":"tt2805096","title":"Chicago P.D.","year":"(2014– )","rating":"8.2","genres":"Action, Crime, Drama","description":"Follows District 21 of the Chicago Police Department, which is made up of two distinctly different groups: the uniformed cops and the Intelligence Unit.","stars":"Jason Beghe, Sophia Bush, Jesse Lee Soffer, Patrick John Flueger","directors":null},{"id":"tt1486217","title":"Archer","year":"(2009– )","rating":"8.8","genres":"Animation, Action, Comedy","description":"Covert black ops and espionage take a back seat to zany personalities and relationships between secret agents and drones.","stars":"H. Jon Benjamin, Judy Greer, Amber Nash, Chris Parnell","directors":null},{"id":"tt2802144","title":"Kingsman: The Secret Service","year":"(2014)","rating":"7.7","genres":"Action, Adventure, Comedy","description":"A spy organization recruits an unrefined, but promising street kid into the agency's ultra-competitive training program, just as a global threat emerges from a twisted tech genius.","stars":"Colin Firth, Taron Egerton, Samuel L. Jackson, Michael Caine","directors":"Matthew Vaughn"},{"id":"tt0499549","title":"Avatar","year":"(2009)","rating":"7.8","genres":"Action, Adventure, Fantasy","description":"A paraplegic marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.","stars":"Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez","directors":"James Cameron"},{"id":"tt2387499","title":"Keeping Up with the Joneses","year":"(2016)","rating":"5.8","genres":"Action, Comedy","description":"A suburban couple becomes embroiled in an international espionage plot when they discover that their seemingly perfect new neighbors are government spies.","stars":"Zach Galifianakis, Isla Fisher, Jon Hamm, Gal Gadot","directors":"Greg Mottola"},{"id":"tt2261391","title":"Chicago Fire","year":"(2012– )","rating":"7.9","genres":"Action, Drama","description":"The story of firefighters in Chicago, both on a personal and professional level.","stars":"Jesse Spencer, Taylor Kinney, Monica Raymund, Yuri Sardarov","directors":null},{"id":"tt0369610","title":"Jurassic World","year":"(2015)","rating":"7.0","genres":"Action, Adventure, Sci-Fi","description":"A new theme park, built on the original site of Jurassic Park, creates a genetically modified hybrid dinosaur, which escapes containment and goes on a killing spree.","stars":"Chris Pratt, Bryce Dallas Howard, Ty Simpkins, Judy Greer","directors":"Colin Trevorrow"},{"id":"tt3230454","title":"The Last Man on Earth","year":"(2015– )","rating":"7.4","genres":"Action, Comedy, Drama","description":"Almost two years after a virus wiped out most of the human race, Phil Miller only wishes for some company, but soon gets more than he bargained for when that company shows up in the form of other survivors.","stars":"Will Forte, January Jones, Cleopatra Coleman, Kristen Schaal","directors":null},{"id":"tt3843168","title":"Z Nation","year":"(2014– )","rating":"6.7","genres":"Action, Comedy, Drama","description":"Three years after the zombie virus has gutted the United States of America a team of everyday heroes must transport the only known survivor of the plague from New York to California, where the last functioning viral lab waits for his blood.","stars":"Russell Hodgkinson, Nat Zang, Keith Allan, Kellita Smith","directors":null},{"id":"tt3514324","title":"Scorpion","year":"(2014– )","rating":"7.2","genres":"Action, Drama","description":"An eccentric genius forms an international network of super-geniuses to act as the last line of defense against the complicated threats of the modern world.","stars":"Elyes Gabel, Katharine McPhee, Eddie Kaye Thomas, Jadyn Wong","directors":null},{"id":"tt1442449","title":"Spartacus: Blood and Sand","year":"(2010–2013)","rating":"8.6","genres":"Action, Adventure, Biography","description":"Watch the story of history's greatest gladiator unfold with graphic violence and the passions of the women that love them. This is Spartacus.","stars":"Andy Whitfield, Lucy Lawless, Manu Bennett, Daniel Feuerriegel","directors":null},{"id":"tt4649466","title":"Kingsman: The Golden Circle","year":"(2017)","genres":"Action, Adventure, Comedy","description":"When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency Statesman to save the world.","stars":"Taron Egerton, Jeff Bridges, Channing Tatum, Halle Berry","directors":"Matthew Vaughn"},{"id":"tt0185906","title":"Band of Brothers","year":"(2001)","rating":"9.5","genres":"Action, Drama, History","description":"The story of Easy Company of the US Army 101st Airborne division and their mission in WWII Europe from Operation Overlord through V-J Day.","stars":"Scott Grimes, Damian Lewis, Ron Livingston, Shane Taylor","directors":null},{"id":"tt0112178","title":"Star Trek: Voyager","year":"(1995–2001)","rating":"7.7","genres":"Action, Adventure, Sci-Fi","description":"Pulled to the far side of the galaxy, where the Federation is 75 years away at maximum warp speed, a Starfleet ship must cooperate with Maquis rebels to find a way home.","stars":"Kate Mulgrew, Robert Beltran, Roxann Dawson, Robert Duncan McNeill","directors":null},{"id":"tt0113568","title":"Kôkaku Kidôtai","year":"(1995)","rating":"8.0","genres":"Animation, Action, Crime","description":"A cyborg policewoman and her partner hunt a mysterious and powerful hacker called the Puppet Master.","stars":"Atsuko Tanaka, Iemasa Kayumi, Akio Ôtsuka, Kôichi Yamadera","directors":"Mamoru Oshii"},{"id":"tt0290334","title":"X2","year":"(2003)","rating":"7.5","genres":"Action, Adventure, Fantasy","description":"The X-Men band together to find a mutant assassin who has made an attempt on the President's life, while the Mutant Academy is attacked by military forces.","stars":"Patrick Stewart, Hugh Jackman, Halle Berry, Ian McKellen","directors":"Bryan Singer"},{"id":"tt5511582","title":"Timeless","year":"(2016– )","rating":"7.6","genres":"Action, Adventure, Drama","description":"An unlikely trio travel through time in order to battle unknown criminals and protect history as we know it.","stars":"Abigail Spencer, Matt Lanter, Malcolm Barrett, Paterson Joseph","directors":null},{"id":"tt2930604","title":"Star Wars Rebels","year":"(2014– )","rating":"8.0","genres":"Animation, Action, Adventure","description":"A brave and clever ragtag starship crew stands up against the evil Empire as it tightens its grip on the galaxy and hunts down the last of the Jedi Knights.","stars":"Taylor Gray, Freddie Prinze Jr., Vanessa Marshall, Steve Blum","directors":null},{"id":"tt1825683","title":"Black Panther","year":"(2018)","genres":"Action, Drama, Sci-Fi","description":"T'Challa, the new ruler of the advanced kingdom of Wakanda, must defend his land from being torn apart by enemies from outside and inside the country.","stars":"Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, Danai Gurira","directors":"Ryan Coogler"},{"id":"tt4172430","title":"13 Hours","year":"(2016)","rating":"7.3","genres":"Action, Drama, History","description":"During an attack on a U.S. compound in Libya, a security team struggles to make sense out of the chaos.","stars":"John Krasinski, Pablo Schreiber, James Badge Dale, David Denman","directors":"Michael Bay"},{"id":"tt2395427","title":"Avengers: Age of Ultron","year":"(2015)","rating":"7.4","genres":"Action, Adventure, Sci-Fi","description":"When Tony Stark and Bruce Banner try to jump-start a dormant peacekeeping program called Ultron, things go horribly wrong and it's up to Earth's Mightiest Heroes to stop the villainous Ultron from enacting his terrible plans.","stars":"Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth","directors":"Joss Whedon"},{"id":"tt2557478","title":"Pacific Rim: Uprising","year":"(2018)","genres":"Action, Adventure, Sci-Fi","description":"Follow-up to Guillermo del Toro's 'Pacific Rim'.","stars":"Tian Jing, Scott Eastwood, Adria Arjona, Charlie Day","directors":"Steven S. DeKnight"},{"id":"tt0285331","title":"24","year":"(2001–2010)","rating":"8.4","genres":"Action, Crime, Drama","description":"Jack Bauer, Director of Field Ops for the Counter-Terrorist Unit of Los Angeles, races against the clock to subvert terrorist plots and save his nation from ultimate disaster.","stars":"Kiefer Sutherland, Mary Lynn Rajskub, Carlos Bernard, Dennis Haysbert","directors":null},{"id":"tt0317705","title":"The Incredibles","year":"(2004)","rating":"8.0","genres":"Animation, Action, Adventure","description":"A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world.","stars":"Craig T. Nelson, Samuel L. Jackson, Holly Hunter, Jason Lee","directors":"Brad Bird"},{"id":"tt3647498","title":"Blood Father","year":"(2016)","rating":"6.4","genres":"Action, Crime, Drama","description":"An ex-con reunites with his estranged wayward 17-year old daughter to protect her from drug dealers who are trying to kill her.","stars":"Mel Gibson, Erin Moriarty, Diego Luna, Michael Parks","directors":"Jean-François Richet"},{"id":"tt4680182","title":"Colossal","year":"(2016)","rating":"6.6","genres":"Action, Comedy, Sci-Fi","description":"A woman discovers that severe catastrophic events are somehow connected to the mental breakdown from which she's suffering.","stars":"Dan Stevens, Anne Hathaway, Jason Sudeikis, Tim Blake Nelson","directors":"Nacho Vigalondo"},{"id":"tt1781827","title":"Hands of Stone","year":"(2016)","rating":"6.6","genres":"Action, Biography, Drama","description":"The legendary Roberto Duran and his equally legendary trainer Ray Arcel change each other's lives.","stars":"Edgar Ramírez, Usher Raymond, Robert De Niro, Rubén Blades","directors":"Jonathan Jakubowicz"},{"id":"tt3397884","title":"Sicario","year":"(2015)","rating":"7.6","genres":"Action, Crime, Drama","description":"An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico.","stars":"Emily Blunt, Josh Brolin, Benicio Del Toro, Jon Bernthal","directors":"Denis Villeneuve"},{"id":"tt0455944","title":"The Equalizer","year":"(2014)","rating":"7.2","genres":"Action, Crime, Thriller","description":"A man believes he has put his mysterious past behind him and has dedicated himself to beginning a new, quiet life. But when he meets a young girl under the control of ultra-violent Russian gangsters, he can't stand idly by - he has to help her.","stars":"Denzel Washington, Marton Csokas, Chloë Grace Moretz, David Harbour","directors":"Antoine Fuqua"},{"id":"tt1345836","title":"The Dark Knight Rises","year":"(2012)","rating":"8.5","genres":"Action, Thriller","description":"Eight years after the Joker's reign of anarchy, the Dark Knight, with the help of the enigmatic Selina, is forced from his imposed exile to save Gotham City, now on the edge of total annihilation, from the brutal guerrilla terrorist Bane.","stars":"Christian Bale, Tom Hardy, Anne Hathaway, Gary Oldman","directors":"Christopher Nolan"},{"id":"tt0172495","title":"Gladiator","year":"(2000)","rating":"8.5","genres":"Action, Adventure, Drama","description":"When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge.","stars":"Russell Crowe, Joaquin Phoenix, Connie Nielsen, Oliver Reed","directors":"Ridley Scott"},{"id":"tt2234222","title":"Orphan Black","year":"(2013– )","rating":"8.4","genres":"Action, Drama, Sci-Fi","description":"A streetwise hustler is pulled into a compelling conspiracy after witnessing the suicide of a girl who looks just like her.","stars":"Tatiana Maslany, Dylan Bruce, Jordan Gavaris, Kevin Hanchard","directors":null},{"id":"tt4939950","title":"SS-GB","year":"(2017– )","rating":"6.6","genres":"Action, Drama, Thriller","description":"A British homicide detective investigates a murder in a German-occupied England in a parallel universe where the Nazis won World War II.","stars":"Sam Riley, James Cosmo, Rainer Bock, Kate Bosworth","directors":null},{"id":"tt2381991","title":"The Huntsman: Winter's War","year":"(2016)","rating":"6.1","genres":"Action, Adventure, Drama","description":"Eric and fellow warrior Sara, raised as members of ice Queen Freya's army, try to conceal their forbidden love as they fight to survive the wicked intentions of both Freya and her sister Ravenna.","stars":"Chris Hemsworth, Jessica Chastain, Charlize Theron, Emily Blunt","directors":"Cedric Nicolas-Troyan"},{"id":"tt2072233","title":"Sleepless","year":"(III) (2017)","rating":"5.5","genres":"Action, Crime, Thriller","description":"A cop with a connection to the criminal underworld scours a nightclub in search of his kidnapped son.","stars":"Jamie Foxx, Michelle Monaghan, Dermot Mulroney, Gabrielle Union","directors":"Baran bo Odar"},{"id":"tt1628841","title":"Independence Day: Resurgence","year":"(2016)","rating":"5.3","genres":"Action, Adventure, Sci-Fi","description":"Two decades after the first Independence Day invasion, Earth is faced with a new extra-Solar threat. But will mankind's new space defenses be enough?","stars":"Liam Hemsworth, Jeff Goldblum, Bill Pullman, Maika Monroe","directors":"Roland Emmerich"},{"id":"tt4800878","title":"Stan Lee's Lucky Man","year":"(2016– )","rating":"7.2","genres":"Action, Sci-Fi","description":"From the mind of comic book legend Stan Lee comes a bold new action crime series about a brilliant but flawed police officer with the power to control luck.","stars":"Stephen Hagan, Leilah de Meza, James Nesbitt, Eve Best","directors":null},{"id":"tt0090605","title":"Aliens","year":"(1986)","rating":"8.4","genres":"Action, Adventure, Sci-Fi","description":"The moon from Alien (1979) has been colonized, but contact is lost. This time, the rescue team has impressive firepower, but will it be enough?","stars":"Sigourney Weaver, Michael Biehn, Carrie Henn, Paul Reiser","directors":"James Cameron"},{"id":"tt3949660","title":"Teenage Mutant Ninja Turtles: Out of the Shadows","year":"(2016)","rating":"6.0","genres":"Action, Adventure, Comedy","description":"After facing Shredder, who has joined forces with mad scientist Baxter Stockman and henchmen Bebop and Rocksteady to take over the world, the Turtles must confront an even greater nemesis: the notorious Krang.","stars":"Megan Fox, Will Arnett, Tyler Perry, Laura Linney","directors":"Dave Green"},{"id":"tt0446029","title":"Scott Pilgrim vs. the World","year":"(2010)","rating":"7.5","genres":"Action, Comedy, Fantasy","description":"Scott Pilgrim must defeat his new girlfriend's seven evil exes in order to win her heart.","stars":"Michael Cera, Mary Elizabeth Winstead, Kieran Culkin, Alison Pill","directors":"Edgar Wright"},{"id":"tt0800369","title":"Thor","year":"(2011)","rating":"7.0","genres":"Action, Adventure, Fantasy","description":"The powerful but arrogant god Thor is cast out of Asgard to live amongst humans in Midgard (Earth), where he soon becomes one of their finest defenders.","stars":"Chris Hemsworth, Anthony Hopkins, Natalie Portman, Tom Hiddleston","directors":"Kenneth Branagh"},{"id":"tt3450958","title":"War for the Planet of the Apes","year":"(2017)","genres":"Action, Adventure, Drama","description":"A nation of genetically evolved apes led by Caesar becomes embroiled in a battle with an army of humans.","stars":"Woody Harrelson, Judy Greer, Andy Serkis, Terry Notary","directors":"Matt Reeves"},{"id":"tt0113820","title":"Mighty Morphin Power Rangers: The Movie","year":"(1995)","rating":"5.1","genres":"Action, Adventure, Family","description":"A giant egg is unearthed at a construction site and soon opened, releasing the terrible Ivan Ooze, who wreaks vengeance on Zordon for imprisoning him millennia ago. With Zordon dying and their powers lost, the Rangers head to a distant planet to find the mystic warrior Dulcea.","stars":"Karan Ashley, Johnny Yong Bosch, Steve Cardenas, Jason David Frank","directors":"Bryan Spicer"},{"id":"tt0087332","title":"Ghostbusters","year":"(1984)","rating":"7.8","genres":"Action, Adventure, Comedy","description":"Three former parapsychology professors set up shop as a unique ghost removal service.","stars":"Bill Murray, Dan Aykroyd, Sigourney Weaver, Harold Ramis","directors":"Ivan Reitman"},{"id":"tt5544384","title":"Gekijo-ban Sword Art Online: Ordinal Scale","year":"(2017)","rating":"8.0","genres":"Animation, Action, Adventure","description":"In 2026, a new machine called the Augma is developed to compete against the NerveGear and its successor, the Amusphere. A next-gen wearable device, the Augma doesn't have a full-dive ...                See full summary »","stars":"Ryan Bartley, Christine Marie Cabanos, Robbie Daymond, Marc Diraison","directors":"Tomohiko Ito"},{"id":"tt3110958","title":"Now You See Me 2","year":"(2016)","rating":"6.5","genres":"Action, Adventure, Comedy","description":"The Four Horsemen resurface and are forcibly recruited by a tech genius to pull off their most impossible heist yet.","stars":"Jesse Eisenberg, Mark Ruffalo, Woody Harrelson, Dave Franco","directors":"Jon M. Chu"},{"id":"tt1392170","title":"The Hunger Games","year":"(2012)","rating":"7.2","genres":"Action, Adventure, Sci-Fi","description":"Katniss Everdeen voluntarily takes her younger sister's place in the Hunger Games, a televised competition in which two teenagers from each of the twelve Districts of Panem are chosen at random to fight to the death.","stars":"Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Stanley Tucci","directors":"Gary Ross"}]